I tried 2.22.0 with the following configuration:
```
resource "azurerm_cdn_endpoint" "cdn_endpoint" {
  name                          = "endpoint"
  profile_name                  = azurerm_cdn_profile.example.name
  location                      = azurerm_resource_group.example.location
  resource_group_name           = azurerm_resource_group.example.name
  is_http_allowed               = true
  is_https_allowed              = true
  querystring_caching_behaviour = "NotSet"
  origin_host_header            = azurerm_storage_account.example.primary_web_host

  origin {
    name      = "origin"
    host_name = azurerm_storage_account.example.primary_web_host
  }
}
```

Seems like terraform is adding the `is_compression_enabled` property by default, "NotSet" solution is not working on that property. It's only accepting True or False. Any idea how this property can be removed from deploy on a Premium CDN? 

```
+ resource "azurerm_cdn_endpoint" "cdn_endpoint" {
      + content_types_to_compress     = (known after apply)
      + host_name                     = (known after apply)
      + id                            = (known after apply)
-->   + is_compression_enabled        = false
      + is_http_allowed               = true
      + is_https_allowed              = true
      + location                      = "westeurope"
      + name                          = "app-cdn"
      + origin_host_header            = "app.web.core.windows.net"
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "azdatreuw-cdn-roots"
      + querystring_caching_behaviour = "NotSet"
      + resource_group_name           = "app-rg"

      + origin {
          + host_name  = "app.web.core.windows.net"
          + http_port  = 80
          + https_port = 443
          + name       = "cdn-origin"
        }
    }
```